projects/project-report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-02 tor 00:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Report Template</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Wrigstad" />
<link rel="stylesheet" type="text/css" href="/home/stw/t/ioopm/2018/site/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/home/stw/t/ioopm/2018/site/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Project Report Template</h1>
<div id="table-of-contents">
Project\ Report\ Template</br><h2>Project Report Template


















</br>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8dd67e2">1. Group name</a>
<ul>
<li><a href="#org579ac5e">1.1. Participant list</a></li>
</ul>
</li>
<li><a href="#orgf6cece3">2. Quantification</a></li>
<li><a href="#org10fd68e">3. Process</a>
<ul>
<li><a href="#orgad41525">3.1. Inception</a></li>
<li><a href="#org3d21ac0">3.2. Implementation</a></li>
</ul>
</li>
<li><a href="#orge3b0e3f">4. Use of Tools</a></li>
<li><a href="#orgea4810d">5. Communication, Cooperation and Coordination</a></li>
<li><a href="#orgb8e5fd2">6. Work Breakdown Structure</a></li>
<li><a href="#org82b7902">7. Quality Assurance</a></li>
<li><a href="#org8f494c1">8. Reflection</a></li>
</ul>
</div>
</div>
<p>
This course is not about writing reports. However, writing a
report is key to reflecting what you did, and also helps us
complete our picture of how your team did function during the
project. The most important part is that you <b><b>never, ever make
things up</b></b>. That defeats the whole purpose! Let's say you never
picked a process &#x2013; now is the time to admit that.
</p>

<p>
A report should not be boring and unreadable. That means that the
text needs to <i>want to be read</i>. There needs to be a "story" and
not just a number of disconnected facts. For each section, figure
out what is its meaning, what is your message for that section,
and for each paragraph, how does it contribute to conveying that
message and for each sentence, how does it fit in that paragraph.
</p>

<p>
If you turn each individual bullet point below into a question and
try to answer it, the report is going to be crap. You will
approach it from the perspective of "lets solve the 'we need to
have a report' problem", and that is not acceptable. Write a
report that you can stand by. <b><b>Please write a short report</b></b> &#x2013;
but don't make it too short so that it effectively is unable to
convey anything of importance at a reasonable level of detail.
</p>

<p>
If you find something <i>impossible to discuss</i>, state that and
explain.
</p>

<p>
If you find something <i>completely pointless to discuss</i>, state
that and explain.
</p>

<p>
You must follow the top-level section ordering (and have exactly
these eight top-level section headings) but feel free to structure
content under each heading as you see fit. Don't try to "answer
questions". Ordering of bullets under each heading below is
random. Don't make your answer ordering random!
</p>

<p>
In the cases where you are asked to provide a number on a scale
1&#x2013;7, 7 is always best. If you cannot agree on a number, vote,
sum, average and explain that is how you arrived at the number you
are giving.
</p>

<p>
<i>The target audience for this report is Tobias, the coaches, the TAs and interested members of other teams that want to know what happend in your team. If you feel that your report is concise enough to be read by members of other teams while still getting something out of reading it, you are probably doing it right.</i>
</p>


<div id="outline-container-org8dd67e2" class="outline-2">
<h2 id="org8dd67e2"><span class="section-number-2">1</span> Group name</h2>
<div class="outline-text-2" id="text-1">
<p>
Start by stating the name of your group/team clearly
</p>
</div>
<div id="outline-container-org579ac5e" class="outline-3">
<h3 id="org579ac5e"><span class="section-number-3">1.1</span> Participant list</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">email</td>
<td class="org-left">active dates</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">1/12 -17 &#x2013; 12/1 -18</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgf6cece3" class="outline-2">
<h2 id="orgf6cece3"><span class="section-number-2">2</span> Quantification</h2>
<div class="outline-text-2" id="text-2">
<p>
In this section, state:
</p>
<ul class="org-ul">
<li>Project start date</li>
<li>Project end date</li>
<li>Number of sprints, their start and end dates</li>
<li>Total number of new lines of C code written excluding tests and preexisting code</li>
<li>Total number of lines of test code</li>
<li>Total number of lines of "script code" (e.g., make files, Python scripts for generating test data, etc.)</li>
<li>Total number of hours worked by the team</li>
<li>Total number of git commits</li>
<li>Total number of pull requests</li>
<li>Total number of GitHub issues</li>
</ul>
</div>
</div>
<div id="outline-container-org10fd68e" class="outline-2">
<h2 id="org10fd68e"><span class="section-number-2">3</span> Process</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgad41525" class="outline-3">
<h3 id="orgad41525"><span class="section-number-3">3.1</span> Inception</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In this section, discuss choice of process, how you went about learning the process, how you went about implementing the process.
</p>
</div>
</div>
<div id="outline-container-org3d21ac0" class="outline-3">
<h3 id="org3d21ac0"><span class="section-number-3">3.2</span> Implementation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In this section, discuss:
</p>
<ul class="org-ul">
<li>what you actually implemented</li>
<li>strengths and weaknesses with your implementation of your chosen process</li>
<li>what you would do differently if you were to start over tomorrow</li>
<li>what successes you would attempt to repeat if you were to start over tomorrow</li>
<li>how plans were made, key plans, and to what extent your plans were followed</li>
<li>how decision making happened, key decisions, and whether they were followed</li>
<li>how did you attack the Christmas break problem with planning?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge3b0e3f" class="outline-2">
<h2 id="orge3b0e3f"><span class="section-number-2">4</span> Use of Tools</h2>
<div class="outline-text-2" id="text-4">
<p>
In this section, discuss:
</p>
<ul class="org-ul">
<li>what tools you used in the project</li>
<li>what use you had of those tools</li>
<li>if there were any tools you were lacking</li>
<li>tools you would rather not use in the future</li>
</ul>
</div>
</div>
<div id="outline-container-orgea4810d" class="outline-2">
<h2 id="orgea4810d"><span class="section-number-2">5</span> Communication, Cooperation and Coordination</h2>
<div class="outline-text-2" id="text-5">
<p>
In this section, discuss:
</p>
<ul class="org-ul">
<li>the communication between team members and with people outside the team</li>
<li>the cooperation between team members</li>
<li>the coordination between team members with respect to technical tasks</li>
<li>how did you deal with team members that were demotivated, angry, stressed about things outside of the project?</li>
<li>how did you handle communication, cooperation and coordination during the break?</li>
<li>lessons learned</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8e5fd2" class="outline-2">
<h2 id="orgb8e5fd2"><span class="section-number-2">6</span> Work Breakdown Structure</h2>
<div class="outline-text-2" id="text-6">
<p>
In this section, discuss:
</p>
<ul class="org-ul">
<li>how the programming tasks were divided, distributed, carried out, load-balanced, etc. – if you used pair programming how did that go? Did you use it for everything?</li>
<li>what were the actual tasks</li>
<li>did you manage to load-balance the workload so that no one was overwhelmed, how/why not?</li>
<li>were tasks of equal sizes or not, and how you handled if they were not</li>
<li>your thoughts on how does one estimate how much time a task will take</li>
</ul>
</div>
</div>
<div id="outline-container-org82b7902" class="outline-2">
<h2 id="org82b7902"><span class="section-number-2">7</span> Quality Assurance</h2>
<div class="outline-text-2" id="text-7">
<p>
In this section, discuss:
</p>
<ul class="org-ul">
<li>where the spec is unclear &#x2013; what is your confidence that you are implementing the right thing (why, how, etc.)</li>
<li>your strategy for testing (on all levels: unit/integration/regression) &#x2013; including <i>when</i> tests were written, by <i>whom</i>, etc.</li>
<li>your strategy for working with pull requests &#x2013; including how many PRs did you do, by how many people, how many reviews, how many comments on PRs</li>
<li>what changes to code came out of pull request reviews</li>
<li>did you manage to take pull requests seriously &#x2013; how did working with PRs change your attitude towards coding?</li>
<li>exemplify best and worst quality of names and descriptions for pull requests</li>
<li>lessons learned</li>
</ul>
</div>
</div>
<div id="outline-container-org8f494c1" class="outline-2">
<h2 id="org8f494c1"><span class="section-number-2">8</span> Reflection</h2>
<div class="outline-text-2" id="text-8">
<p>
In this section, discuss <b>briefly</b>:
</p>
<ul class="org-ul">
<li>On a scale 1&#x2013;7 (7 is best), rate your satisfaction with your <i>process</i> and provide justification for that number</li>
<li>On a scale 1&#x2013;7 (7 is best), rate your satisfaction with your <i>delivered product</i> and provide justification for that number</li>
<li>On a scale 1&#x2013;7 (7 is best), rate your satisfaction with your <i>quality assurance</i> and provide justification for that number</li>
<li>what does the team consider its biggest win?</li>
<li>what does the team consider its biggest fail?</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobias Wrigstad</p>
<p class="date">Created: 2018-08-02 tor 00:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
